# Исходный образ с Python 3.12
FROM python:3.12-slim

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем сначала файл с зависимостями
# (Docker кэширует этот слой, и если зависимости не менялись, переустановка не потребуется)
COPY requirements.txt .

# Устанавливаем все Python-библиотеки, нужные для работы бота
RUN pip install --no-cache-dir -r requirements.txt

# Копируем весь остальной код проекта в рабочую директорию
COPY . .

# Команда, которая будет выполняться при запуске контейнера
CMD ["python", "main.py"]